@shrsr Thank you for looking into this. Here is the output of the plan when ignoring changes to the new relationship attributes. If I proceed with the apply it will replace the existing `""` values for the relationships with `"default"`

```Running terraform plan...
/usr/local/bin/actions-runner/_work/_temp/51af674e-0791-420e-834d-96b154de7378/terraform-bin plan -detailed-exitcode -out=tfplan -var=aci_username=*** -var=aci_password=*** -var=aci_url=*** -var=aci_insecure=true
aci_tenant.tenants["test"]: Refreshing state... [id=uni/tn-test]
aci_vrf.vrfs["vrf1"]: Refreshing state... [id=uni/tn-test/ctx-vrf1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aci_tenant.tenants["test"] will be updated in-place
  ~ resource "aci_tenant" "tenants" {
        id                            = "uni/tn-test"
        name                          = "test"
      ~ relation_fv_rs_tenant_mon_pol = "uni/tn-common/monepg-default" -> (known after apply)
        tags                          = []
        # (4 unchanged attributes hidden)
    }

  # aci_vrf.vrfs["vrf1"] will be updated in-place
  ~ resource "aci_vrf" "vrfs" {
        id                                        = "uni/tn-test/ctx-vrf1"
        name                                      = "vrf1"
      ~ pc_tag                                    = "49153" -> (known after apply)
      ~ relation_fv_rs_bgp_ctx_pol                = "uni/tn-common/bgpCtxP-default" -> (known after apply)
      + relation_fv_rs_ctx_mon_pol                = (known after apply)
      ~ relation_fv_rs_ctx_to_ep_ret              = "uni/tn-common/epRPol-default" -> (known after apply)
      ~ relation_fv_rs_ctx_to_ext_route_tag_pol   = "uni/tn-common/rttag-default" -> (known after apply)
      ~ relation_fv_rs_ospf_ctx_pol               = "uni/tn-common/ospfCtxP-default" -> (known after apply)
      ~ scope                                     = "2621441" -> (known after apply)
        tags                                      = []
      ~ tenant_dn                                 = "uni/tn-test" -> (known after apply)
        # (19 unchanged attributes hidden)
    }```